# GetBuildingStorey Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLevelInfo..::..GetBuildingStorey Method
IFCLevelInfo Class See Also
---
Gets the IfcBuildingStorey handle.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCAnyHandle GetBuildingStorey()
```

Visual Basic
---
```text
Public Function GetBuildingStorey As IFCAnyHandle
```

Visual C++
---
```text
public:
IFCAnyHandle^ GetBuildingStorey()
```

# ### Return Value
The handle.
# See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace